# s1=input("输入一串字符串:")
# print(s1[0])
# #输出第一个字符
# #print(s1[0]:s1[3]:1)错误
# print(s1[0:3:1])#输出前三个字符
# print(s1[-3::1])#输出后三个字符
# print(len(s1))#输出字符串长度
# print(s1.find('u'))#输出字符'u'在字符串中第一个位置的索引值
# print(s1.count('c'))#输出字符'c'出现的总次数
# print(s1.replace(".","-"))#将字符串中所有的"."替换为"-"
# print(s1.upper())#将字符串中所有的字母全部转换为大写字母并输出；
# print(s1.split("."))#删除字符串中的标点符号，把字符串拆分为四个字符串
# #202519019 梁欣


s1=input("我的名字是:")
s2=input("我第一个室友的名字是：")
s3=input("我第二个室友的名字是：")
s4=input("我第三个室友的名字是：")
print(f"我们的组合是:{s1[-1]}{s2[-1]}{s3[-1]}{s4[-1]}")
#202519019 梁欣